#include <stdio.h>

// 2進数の切り捨て
int round_down(int x, int y) {
  // e.g. x = 65, y = 8 の場合 : 65 を 8 の倍数に切り捨て
  //   x & ~(y - 1)
  //   -> 65 & ~(8 - 1)
  //   -> 01000001 & ~(00001000 - 00000001)
  //   -> 01000001 & ~(00000111)
  //   -> 01000001 & 11111000
  //   -> 01000000 (8 以下は & をとることで切り捨てられる)
  //   -> 64
  return x & ~(y - 1);
}

// 2進数の切り上げ
int round_up(int x, int y) {
  // e.g. x = 66, y = 8 の場合 : 66 を 8 の倍数に切り上げ
  //   (x + y - 1) & ~(y - 1)
  //   -> (66 + 8 - 1) & ~(8 - 1)
  //   -> (01000010 + 00001000 - 00000001) & ~(00001000 - 00000001)
  //   -> (01000010 + 00000111) & ~(00001000 - 00000001)
  //   -> (01000010 + 00000111) & ~(00000111)
  //   -> 01001001 & ~(00000111) (+ y - 1 をすることで8 以下が切り上げられる)
  //   -> 01001001 & 11111000
  //   -> 01001000 (8 以下は & をとることで切り捨てられる)
  //   -> 72
  return (x + y - 1) & ~(y - 1);
}

int main() {
  printf("Round down (63, 8): %d\n", round_down(63, 8));
  printf("Round down (64, 8): %d\n", round_down(64, 8));
  printf("Round down (65, 8): %d\n", round_down(65, 8));

  printf("Round up (63, 8): %d\n", round_up(63, 8));
  printf("Round up (64, 8): %d\n", round_up(64, 8));
  printf("Round up (65, 8): %d\n", round_up(65, 8));
}
